# GetAreasOfCurveLoops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofComponents..::..GetAreasOfCurveLoops Method
RoofComponents Class See Also
---
The areas of CurveLoops of roof slabs.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<double> GetAreasOfCurveLoops()
```

Visual Basic
---
```text
Public Function GetAreasOfCurveLoops As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetAreasOfCurveLoops()
```

# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace